app/Controllers/Home.php

    public function addUser()
    {
        $userModel = new UserModel();
        // Captura os dados enviados no POST
        $data = [
            'name'  => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
        ];

        $userModel->save($data);
---
INSERT INTO `users` (`name`, `email`) VALUES ('janice', 'oliveira.janice.ufpe@gmail.com')

    public function edit($id): string
    {
        $userModel = new UserModel();
        $data['user'] = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '20'

    public function deletar($id)
{
    $userModel = new UserModel();

    // Verifica se o usuário existe
    $user = $userModel->find($id);
    if ($user) {
        // Deleta o usuário passando o ID
        $userModel->delete($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '18'
DELETE FROM `users`
WHERE `id` IN ('18')