app/Models/UserModel.php

SELECT *
FROM `users`
---
    public function getUsers()
    {
        $result = $this->findAll();  // Busca todos os registros da tabela